nxp-mcuxpresso/mcux-sdk/devices/LPC54018M/LPC54018M.h
#define MRT_IRQ_FLAG_GFLAG1_MASK                 (0x2U)
#define MRT_IRQ_FLAG_GFLAG1_SHIFT                (1U)
/*! GFLAG1 - Monitors the interrupt flag of TIMER1. See description of channel 0.
 */
#define MRT_IRQ_FLAG_GFLAG1(x)                   (((uint32_t)(((uint32_t)(x)) << MRT_IRQ_FLAG_GFLAG1_SHIFT)) & MRT_IRQ_FLAG_GFLAG1_MASK)

#define MRT_IRQ_FLAG_GFLAG2_MASK                 (0x4U)
#define MRT_IRQ_FLAG_GFLAG2_SHIFT                (2U)
/*! GFLAG2 - Monitors the interrupt flag of TIMER2. See description of channel 0.
 */
#define MRT_IRQ_FLAG_GFLAG2(x)                   (((uint32_t)(((uint32_t)(x)) << MRT_IRQ_FLAG_GFLAG2_SHIFT)) & MRT_IRQ_FLAG_GFLAG2_MASK)

#define MRT_IRQ_FLAG_GFLAG3_MASK                 (0x8U)
#define MRT_IRQ_FLAG_GFLAG3_SHIFT                (3U)
/*! GFLAG3 - Monitors the interrupt flag of TIMER3. See description of channel 0.
 */
#define MRT_IRQ_FLAG_GFLAG3(x)                   (((uint32_t)(((uint32_t)(x)) << MRT_IRQ_FLAG_GFLAG3_SHIFT)) & MRT_IRQ_FLAG_GFLAG3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MRT_Register_Masks */


/* MRT - Peripheral instance base addresses */
/** Peripheral MRT0 base address */
#define MRT0_BASE                                (0x4000D000u)
/** Peripheral MRT0 base pointer */
#define MRT0                                     ((MRT_Type *)MRT0_BASE)
/** Array initializer of MRT peripheral base addresses */
#define MRT_BASE_ADDRS                           { MRT0_BASE }
/** Array initializer of MRT peripheral base pointers */
#define MRT_BASE_PTRS                            { MRT0 }
/** Interrupt vectors for the MRT peripheral type */
#define MRT_IRQS                                 { MRT0_IRQn }

/*!
 * @}
 */ /* end of group MRT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OTPC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OTPC_Peripheral_Access_Layer OTPC Peripheral Access Layer
 * @{
 */

/** OTPC - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[48];
  __I  uint32_t BOOTROM;                           /**< Boot ROM control data., offset: 0x30 */
} OTPC_Type;

/* ----------------------------------------------------------------------------
   -- OTPC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OTPC_Register_Masks OTPC Register Masks
 * @{
 */

/*! @name BOOTROM - Boot ROM control data. */
/*! @{ */

#define OTPC_BOOTROM_PARITY_MASK                 (0x3U)
#define OTPC_BOOTROM_PARITY_SHIFT                (0U)
/*! PARITY - Parity of bit14 to bit2.
 */
#define OTPC_BOOTROM_PARITY(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_PARITY_SHIFT)) & OTPC_BOOTROM_PARITY_MASK)

#define OTPC_BOOTROM_SECUREBOOTEN_MASK           (0x4U)
#define OTPC_BOOTROM_SECUREBOOTEN_SHIFT          (2U)
/*! SECUREBOOTEN - Secure boot enable. When set, all images must be signed and/or encrypted.
 */
#define OTPC_BOOTROM_SECUREBOOTEN(x)             (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_SECUREBOOTEN_SHIFT)) & OTPC_BOOTROM_SECUREBOOTEN_MASK)

#define OTPC_BOOTROM_SECUREBOOTTYPE_MASK         (0x18U)
#define OTPC_BOOTROM_SECUREBOOTTYPE_SHIFT        (3U)
/*! SECUREBOOTTYPE - Secure Boot Type.
 */
#define OTPC_BOOTROM_SECUREBOOTTYPE(x)           (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_SECUREBOOTTYPE_SHIFT)) & OTPC_BOOTROM_SECUREBOOTTYPE_MASK)

#define OTPC_BOOTROM_SIGNATURE_PREFORMAT_MASK    (0x20U)
#define OTPC_BOOTROM_SIGNATURE_PREFORMAT_SHIFT   (5U)
/*! SIGNATURE_PREFORMAT - Image signature and signature in NXP certificate are pre-formatted.
 */
#define OTPC_BOOTROM_SIGNATURE_PREFORMAT(x)      (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_SIGNATURE_PREFORMAT_SHIFT)) & OTPC_BOOTROM_SIGNATURE_PREFORMAT_MASK)

#define OTPC_BOOTROM_SWDEN0_MASK                 (0x40U)
#define OTPC_BOOTROM_SWDEN0_SHIFT                (6U)
/*! SWDEN0 - This bit along with bit SWDEN1 is used to control enabling/disabling SWD.
 */
#define OTPC_BOOTROM_SWDEN0(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_SWDEN0_SHIFT)) & OTPC_BOOTROM_SWDEN0_MASK)

#define OTPC_BOOTROM_ISP_PINS_DISABLED_MASK      (0x80U)
#define OTPC_BOOTROM_ISP_PINS_DISABLED_SHIFT     (7U)
/*! ISP_PINS_DISABLED - This bit controls the ability to enter ISP mode with pin selection.
 */
#define OTPC_BOOTROM_ISP_PINS_DISABLED(x)        (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_ISP_PINS_DISABLED_SHIFT)) & OTPC_BOOTROM_ISP_PINS_DISABLED_MASK)

#define OTPC_BOOTROM_ISP_IAP_DISABLED_MASK       (0x100U)
#define OTPC_BOOTROM_ISP_IAP_DISABLED_SHIFT      (8U)
/*! ISP_IAP_DISABLED - ISP entry through IAP API.
 */
#define OTPC_BOOTROM_ISP_IAP_DISABLED(x)         (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_ISP_IAP_DISABLED_SHIFT)) & OTPC_BOOTROM_ISP_IAP_DISABLED_MASK)

#define OTPC_BOOTROM_BOOT_SRC_MASK               (0x600U)
#define OTPC_BOOTROM_BOOT_SRC_SHIFT              (9U)
/*! BOOT_SRC - Boot source.
 */
#define OTPC_BOOTROM_BOOT_SRC(x)                 (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_BOOT_SRC_SHIFT)) & OTPC_BOOTROM_BOOT_SRC_MASK)

#define OTPC_BOOTROM_ISP_MODE_MASK               (0x1800U)
#define OTPC_BOOTROM_ISP_MODE_SHIFT              (11U)
/*! ISP_MODE - Fall through ISP mode.
 */
#define OTPC_BOOTROM_ISP_MODE(x)                 (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_ISP_MODE_SHIFT)) & OTPC_BOOTROM_ISP_MODE_MASK)

#define OTPC_BOOTROM_SWDEN1_MASK                 (0x2000U)
#define OTPC_BOOTROM_SWDEN1_SHIFT                (13U)
/*! SWDEN1 - This bit along with bit SWD_EN0 is used to control enabling/disabling.
 */
#define OTPC_BOOTROM_SWDEN1(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_SWDEN1_SHIFT)) & OTPC_BOOTROM_SWDEN1_MASK)

#define OTPC_BOOTROM_USE_PUF_MASK                (0x4000U)
#define OTPC_BOOTROM_USE_PUF_SHIFT               (14U)
/*! USE_PUF - Encryption key supplied by PUF.
 */
#define OTPC_BOOTROM_USE_PUF(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_USE_PUF_SHIFT)) & OTPC_BOOTROM_USE_PUF_MASK)

#define OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_MASK (0x8000U)
#define OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_SHIFT (15U)
/*! BLOCK_PUF_ENROLL_KEY_CODE - Block PUF enrollment and key code generation.
 */
#define OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE(x) (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_SHIFT)) & OTPC_BOOTROM_BLOCK_PUF_ENROLL_KEY_CODE_MASK)

#define OTPC_BOOTROM_QSPI_DELAY_MASK             (0xE0000U)
#define OTPC_BOOTROM_QSPI_DELAY_SHIFT            (17U)
/*! QSPI_DELAY - Amount of delay ROM has o wait after POR reset before access QSPI flash device.
 */
#define OTPC_BOOTROM_QSPI_DELAY(x)               (((uint32_t)(((uint32_t)(x)) << OTPC_BOOTROM_QSPI_DELAY_SHIFT)) & OTPC_BOOTROM_QSPI_DELAY_MASK)

